[
  {"text": "인공지능은 컴퓨터 시스템이 인간의 지능을 모방하여 학습하고 추론하며 문제를 해결하는 기술입니다."},
  {"text": "머신러닝은 데이터로부터 패턴을 학습하여 예측이나 결정을 내리는 인공지능의 한 분야입니다."},
  {"text": "딥러닝은 인공 신경망을 여러 층으로 쌓아 복잡한 패턴을 학습하는 머신러닝 기법입니다."},
  {"text": "자연어 처리는 컴퓨터가 인간의 언어를 이해하고 생성할 수 있도록 하는 기술입니다."},
  {"text": "트랜스포머는 어텐션 메커니즘을 사용하여 자연어를 효과적으로 처리하는 신경망 구조입니다."},
  {"text": "파이썬은 데이터 과학과 인공지능 분야에서 가장 널리 사용되는 프로그래밍 언어입니다."},
  {"text": "텐서플로우와 파이토치는 딥러닝 모델을 구축하고 학습하는 데 사용되는 주요 프레임워크입니다."},
  {"text": "강화학습은 에이전트가 환경과 상호작용하며 보상을 최대화하는 방향으로 학습하는 방법입니다."},
  {"text": "컴퓨터 비전은 컴퓨터가 이미지와 비디오를 이해하고 분석할 수 있게 하는 기술입니다."},
  {"text": "GPT는 대규모 텍스트 데이터로 사전 학습된 생성형 언어 모델입니다."},
  {"text": "파인튜닝은 사전 학습된 모델을 특정 작업에 맞게 추가 학습시키는 과정입니다."},
  {"text": "데이터 전처리는 머신러닝 모델 학습 전에 데이터를 정제하고 변환하는 중요한 단계입니다."},
  {"text": "과적합은 모델이 학습 데이터에만 지나치게 최적화되어 새로운 데이터에서 성능이 떨어지는 현상입니다."},
  {"text": "배치 정규화는 신경망 학습을 안정화하고 가속화하는 기법입니다."},
  {"text": "임베딩은 단어나 문장을 고차원 벡터 공간에 표현하는 방법입니다."},
  {"text": "인공지능은 기계가 인간처럼 학습하고 판단할 수 있게 만드는 컴퓨터 과학의 한 분야입니다."},
  {"text": "딥러닝은 다층 신경망을 통해 복잡한 데이터 패턴을 자동으로 학습하는 기술입니다."},
  {"text": "머신러닝은 알고리즘이 데이터를 분석하여 스스로 학습하고 개선하는 인공지능 기술입니다."},
  {"text": "신경망은 인간의 뇌 구조를 모방하여 만든 정보 처리 시스템입니다."},
  {"text": "자연어 처리는 컴퓨터가 사람의 언어를 이해하고 처리할 수 있게 하는 인공지능 기술입니다."},
  {"text": "컴퓨터 비전은 기계가 이미지와 영상을 인식하고 이해할 수 있게 하는 기술입니다."},
  {"text": "강화학습은 시행착오를 통해 최적의 행동을 학습하는 머신러닝 방법입니다."},
  {"text": "지도학습은 레이블이 있는 데이터로 모델을 훈련시키는 머신러닝 방법입니다."},
  {"text": "비지도학습은 레이블 없는 데이터에서 패턴을 찾아내는 머신러닝 방법입니다."},
  {"text": "전이학습은 한 작업에서 학습한 지식을 다른 작업에 활용하는 기법입니다."},
  {"text": "텐서플로우는 구글이 개발한 오픈소스 머신러닝 프레임워크입니다."},
  {"text": "파이토치는 페이스북이 개발한 딥러닝 연구를 위한 파이썬 라이브러리입니다."},
  {"text": "케라스는 사용하기 쉬운 고수준 신경망 API입니다."},
  {"text": "옵티마이저는 모델의 가중치를 업데이트하여 손실을 최소화하는 알고리즘입니다."},
  {"text": "활성화 함수는 신경망에 비선형성을 추가하여 복잡한 패턴을 학습할 수 있게 합니다."},
  {"text": "역전파는 신경망의 오차를 역방향으로 전파하여 가중치를 조정하는 알고리즘입니다."},
  {"text": "경사하강법은 손실 함수의 기울기를 이용해 최적값을 찾는 최적화 알고리즘입니다."},
  {"text": "과적합 방지를 위해 드롭아웃, 정규화 등의 기법을 사용합니다."},
  {"text": "데이터 증강은 기존 데이터를 변형하여 학습 데이터를 늘리는 기법입니다."},
  {"text": "교차 검증은 모델의 성능을 평가하기 위해 데이터를 여러 부분으로 나누어 검증하는 방법입니다."},
  {"text": "하이퍼파라미터는 학습 과정에서 사용자가 직접 설정하는 모델의 매개변수입니다."},
  {"text": "손실 함수는 모델의 예측값과 실제값의 차이를 측정하는 함수입니다."},
  {"text": "정확도는 전체 예측 중 올바른 예측의 비율을 나타내는 평가 지표입니다."},
  {"text": "정밀도는 양성으로 예측한 것 중 실제 양성의 비율을 나타냅니다."},
  {"text": "재현율은 실제 양성 중 모델이 양성으로 예측한 비율을 나타냅니다."},
  {"text": "CNN은 이미지 처리에 특화된 합성곱 신경망입니다."},
  {"text": "RNN은 순차 데이터 처리에 적합한 순환 신경망입니다."},
  {"text": "LSTM은 장기 의존성 문제를 해결한 순환 신경망의 변형입니다."},
  {"text": "GAN은 생성자와 판별자가 경쟁하며 학습하는 생성 모델입니다."},
  {"text": "오토인코더는 입력을 압축했다가 복원하는 비지도 학습 모델입니다."},
  {"text": "어텐션 메커니즘은 중요한 정보에 집중할 수 있게 하는 신경망 구조입니다."},
  {"text": "BERT는 양방향으로 문맥을 이해하는 사전 학습 언어 모델입니다."},
  {"text": "GPT는 텍스트 생성에 특화된 트랜스포머 기반 언어 모델입니다."},
  {"text": "배치 크기는 한 번에 처리하는 학습 데이터의 개수를 의미합니다."},
  {"text": "에폭은 전체 학습 데이터를 한 번 학습하는 과정을 의미합니다."}
]